Revit 2027 API
RebarFreeFormAccessor.HasValid3DPathServer Method
 Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValid3DPathServer()
Public Function HasValid3DPathServer As Boolean
public:
bool HasValid3DPathServer()
member HasValid3DPathServer : unit -> bool
Return Value
Boolean
 Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace